Unfortunately, I'm not able to reproduce it. I tried your configuration and it worked as expected.

Here's what I got:
```
➜  test-skiperator terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_manifest.test-application will be created
  + resource "kubernetes_manifest" "test-application" {
      + manifest = {
          + apiVersion = "skiperator.kartverket.no/v1alpha1"
          + kind       = "Application"
          + metadata   = {
              + name      = "shipwreck-test-2"
              + namespace = "shipwreck"
            }
          + spec       = {
              + image     = "nginx"
              + port      = 80
              + replicas  = {
                  + max = 1
                  + min = 1
                }
              + resources = {
                  + limits   = {
                      + cpu              = "20m"
                      + ephemeralStorage = "1G"
                      + memory           = "1G"
                      + storage          = "1G"
                    }
                  + requests = {
                      + cpu              = "10m"
                      + ephemeralStorage = "500M"
                      + memory           = "500M"
                      + storage          = "500M"
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "skiperator.kartverket.no/v1alpha1"
          + kind       = "Application"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "shipwreck-test-2"
              + namespace                  = "shipwreck"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + accessPolicy   = {
                  + inbound  = {
                      + rules = (known after apply)
                    }
                  + outbound = {
                      + external = (known after apply)
                      + rules    = (known after apply)
                    }
                }
              + command        = (known after apply)
              + env            = (known after apply)
              + envFrom        = (known after apply)
              + filesFrom      = (known after apply)
              + gcp            = {
                  + auth = {
                      + serviceAccount = (known after apply)
                    }
                }
              + image          = "nginx"
              + ingresses      = (known after apply)
              + labels         = (known after apply)
              + liveness       = {
                  + failureThreshold = (known after apply)
                  + initialDelay     = (known after apply)
                  + path             = (known after apply)
                  + port             = (known after apply)
                  + timeout          = (known after apply)
                }
              + port           = 80
              + readiness      = {
                  + failureThreshold = (known after apply)
                  + initialDelay     = (known after apply)
                  + path             = (known after apply)
                  + port             = (known after apply)
                  + timeout          = (known after apply)
                }
              + replicas       = {
                  + max                  = 1
                  + min                  = 1
                  + targetCpuUtilization = (known after apply)
                }
              + resourceLabels = (known after apply)
              + resources      = {
                  + limits   = {
                      + "cpu"              = "20m"
                      + "ephemeralStorage" = "1G"
                      + "memory"           = "1G"
                      + "storage"          = "1G"
                    }
                  + requests = {
                      + "cpu"              = "10m"
                      + "ephemeralStorage" = "500M"
                      + "memory"           = "500M"
                      + "storage"          = "500M"
                    }
                }
              + startup        = {
                  + failureThreshold = (known after apply)
                  + initialDelay     = (known after apply)
                  + path             = (known after apply)
                  + port             = (known after apply)
                  + timeout          = (known after apply)
                }
              + strategy       = {
                  + type = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
kubernetes_manifest.test-application: Creating...
kubernetes_manifest.test-application: Creation complete after 0s

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Here are the versions I used for the test:
```
Terraform v1.3.7
on darwin_arm64
+ provider registry.terraform.io/hashicorp/kubernetes v2.17.0

kubectl version --short
Client Version: v1.26.1
Kustomize Version: v4.5.7
Server Version: v1.25.3

https://github.com/kartverket/skiperator@latest
```